Revit 2026 API

# ReinforcementData Properties

---

The ReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ReinforcementData Class

Autodesk.Revit.DB.Structure Namespace